# users APP choiceField


# 권한
LEVEL_CHOICES = (
    ("2", "Lv2_일반사용자"),
    ("1", "Lv1_인증사용자"),
    ("0", "Lv0_관리자"),
)


# 거주지
LOCATION_CHOICES = (
    ("서울", "서울"),
    ("부산", "부산"),
    ("대구", "대구"),
    ("인천", "인천"),
    ("광주", "광주"),
    ("대전", "대전"),
    ("울산", "울산"),
    ("세종", "세종"),
    ("경기", "경기"),
    ("강원", "강원"),
    ("충북", "충북"),
    ("충남", "충남"),
    ("전북", "전북"),
    ("전남", "전남"),
    ("경북", "경북"),
    ("경남", "경남"),
    ("제주", "제주"),
)


# 장르
GENRE_CHOICES = (
    ("노래", "노래"),
    ("악기", "악기"),
    ("영화", "영화"),
)


# 세부분야
POSITION_CHOICES = (
    # 노래
    ("작사", "작사"),
    ("작곡", "작곡"),
    ("보컬", "보컬"),

    # 악기
    ("기타", "기타"),
    ("키보드", "키보드"),
    ("드럼", "드럼"),

    # 배우
    ("연기", "연기"),
    ("촬영", "촬영"),
)